#pragma once
#include <array>


class Player {
private:
	std::array <bool> ship_map [10][10];		//карта расстановки кораблей
	std::array <bool> shot_map [10][10];		//Карта сделанных выстрелов (Карта соперника?)
	int ship_count;		//Количество оставшихся кораблей
public:
	//Конструктор (Производится )
	//Проверка на наличие кораблей (если ноль- проиграл)
	//Размещение корабля на карте
	//Проверка выстрела (повторный выбор одного поля)
	//int getShipCount ()const;		Возвращает количество оставшихся кораблей
	//bool getMapCount (int x,int y)	Проверка попадания

};
